tutorials/rheoBDFoam/flowFocusing/pressureDrivenFlow/flowSimulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-04;

vertices
(

  (-8 -1 -1)
  (-1 -1 -1)
  (-1 1 -1)
  (-8 1 -1)
  (-1 -8 -1)
  (1 -8 -1)
  (1 -1 -1)
  (16 -1 -1)
  (16 1 -1)
  (1 1 -1)
  (1 8 -1)
  (-1 8 -1) //11
  (-8 -1 1)
  (-1 -1 1)
  (-1 1 1)
  (-8 1 1)
  (-1 -8 1)
  (1 -8 1)
  (1 -1 1)
  (16 -1 1)
  (16 1 1)
  (1 1 1)
  (1 8 1)
  (-1 8 1) //23 
  (-8 0 -1)//24
  (-1 0 -1)
  (0 1 -1)
  (0 8 -1)
  (1 0 -1)
  (16 0 -1)
  (0 -1 -1)
  (0 -8 -1) //31
  (-8 0 1)//32
  (-1 0 1)
  (0 1 1)
  (0 8 1)
  (1 0 1)
  (16 0 1)
  (0 -1 1)
  (0 -8 1) //39
  (0 0 -1) //40
  (0 0 1) //41
  
 

);

blocks
(

    hex (0 1 25 24 12 13 33 32) (63 14 15) simpleGrading (.7 1 1) //0    
    hex (24 25 2 3 32 33 14 15) (63 14 15) simpleGrading (.7 1 1) //1

    hex (2 26 27 11 14 34 35 23) (14 63 15) simpleGrading (1 1.4285714286 1) //2
    hex (26 9 10 27 34 21 22 35) (14 63 15) simpleGrading (1 1.4285714286 1) //3

    hex (28 29 8 9 36 37 20 21) (193 14 15) simpleGrading (1 1 1) //4
    hex (6 7 29 28 18 19 37 36) (193 14 15) simpleGrading (1 1 1) //5
    
    hex (31 5 6 30 39 17 18 38) (14 63 15) simpleGrading (1 .7 1) //6
    hex (4 31 30 1 16 39 38 13) (14 63 15) simpleGrading (1 .7 1) //7
    
    hex (25 40 26 2 33 41 34 14) (14 14 15) simpleGrading (1 1 1) //8
    hex (1 30 40 25 13 38 41 33) (14 14 15) simpleGrading (1 1 1) //9
    hex (30 6 28 40 38 18 36 41) (14 14 15) simpleGrading (1 1 1) //10
    hex (40 28 9 26 41 36 21 34) (14 14 15) simpleGrading (1 1 1) //11

 
    
);

edges
(

 
);

boundary
(
    
     inletNorth
     {
      type patch;
      faces
      (
            (11 27 35 23)
            (27 10 22 35)
            
        );
    }
    
    inletSouth
    {
        type patch;
        faces
        (
            (4 31 39 16)
            (31 5 17 39)
            
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (7 29 37 19)
            (29 8 20 37)
            
        );
    }     
    
    inletWest
    {
        type patch;
        faces
        (
            (0 24 32 12)
            (24 3 15 32)
            
        );
    }
    
    frontAndBack
    {
        type wall;
        faces
        (
            (0 1 25 24)
            (24 25 2 3)
            (4 31 30 1)
            (1 30 40 25)
            (25 40 26 2)
            (2 26 27 11)
            (31 5 6 30)
            (30 6 28 40)
            (40 28 9 26)
            (26 9 10 27)
            (6 7 29 28)
            (28 29 8 9)
            (12 13 33 32)
            (32 33 14 15)
            (16 39 38 13)
            (13 38 41 33)
            (33 41 34 14)
            (14 34 35 23)
            (39 17 18 38)
            (38 18 36 41)
            (41 36 21 34)
            (34 21 22 35)
            (18 19 37 36)
            (36 37 20 21)
            
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (3 2 14 15)
            (2 11 23 14)
            (10 9 21 22)
            (9 8 20 21)
            (7 6 18 19)
            (6 5 17 18)
            (1 4 16 13)
            (0 1 13 12)
                     
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
